app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `email`) VALUES('', '5ecd35646ea4f980ea4ddcb2023a213363ca8757', '2009-02-07 17:40:17', 'ae4339c4e37d83966d149b5f5753e4286a2b0b43', NULL, '2009-02-07 17:40:17', NULL, 'glenn@glennfu.com')